{"legislative_session": "104th", "identifier": "HR551", "title": "GUN VIOLENCE-PREVENT", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["resolution"], "subject": [], "abstracts": [{"note": "", "abstract": "Urges the Illinois State Board of Education (ISBE) to identify and publish a list of evidence-based, decision-making, and impulse-control curricula that have been demonstrated to reduce violence involvement, make at least one free or low-cost curriculum available statewide for optional integration into existing Social and Emotional Learning (SEL) instruction, encourage districts to implement these programs using existing resources and staff development, and develop, pilot, and rigorously test new school-based decision-making and violence-prevention curricula that can be easily adopted by ISBE and schools statewide if proven effective in reducing violence. Urges the Administrative Office of the Illinois Courts (AOIC), the Department of Juvenile Justice (DJJ), and county probation and diversion programs to identify and approve evidence-based, decision-making curricula appropriate for minors under supervision, diversion, or detention, to encourage their integration as standard early interventions, and to implement these initiatives within existing budgets and structures. Urges the Illinois Department of Human Services (IDHS) and the Illinois Criminal Justice Information Authority (ICJIA) to coordinate with ISBE, AOIC, DJJ, and local partners to align violence-prevention curricula and community-based interventions across settings. Recognizes Professor Jens Ludwig for his groundbreaking research, leadership, and publication of Unforgiving Places. Acknowledges the contributions of other scholars and organizations advancing behavioral approaches to violence prevention."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. La Shawn K. Ford", "date": "2025-11-10", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}], "sponsorships": [{"name": "La Shawn K. Ford", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"La Shawn K. Ford\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://ilga.gov/documents/legislation/104/HR/PDF/10400HR0551.pdf", "media_type": "application/pdf"}, {"url": "https://ilga.gov/Legislation/BillStatus/FullText?LegDocId=205914&DocName=10400HR0551&DocNum=551&DocTypeID=HR&LegID=164566&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://ilga.gov/Legislation/BillStatus?DocNum=551&GAID=18&DocTypeID=HR&LegId=164566&SessionID=114", "note": ""}], "extras": {}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:il/government", "name": "Illinois", "classification": "state", "division_id": "ocd-division/country:us/state:il"}, "scraped_at": "2025-12-14T23:35:31+00:00", "_id": "94619126-d945-11f0-8691-8267ae84f4b5"}