{"legislative_session": "104th", "identifier": "HB4212", "title": "COURT ACCESS-SAFETY", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Creates the Court Access, Safety, and Participation Act. Makes legislative findings concerning access to the courts. Creates a privilege from civil arrest for a person who in good faith is attending a State court proceeding or who is going to, remaining at, or returning from the place of the court proceeding. Creates a civil cause of action for a violation of the Act if the person alleged to have violated the Act knew or reasonably should have known that the person arrested is a person duly and in good faith attending a State court proceeding in which the person is a party, a witness, a potential witness, or a court companion of a party, witness, or potential witness while going to, remaining at, and returning from the court proceeding. Provides that the injured person may recover statutory damages of $10,000 and actual damages, any equitable or declaratory relief the court deems appropriate and just, and reasonable attorney's fees and costs for a successful action. Prohibits an action from being commenced under the Act against the Illinois court system or any Illinois court system personnel acting lawfully under duty to maintain safety and order in the courts. Provides that nothing in the Act affects any right or defense, including any existing qualified immunity defense, of any person, police officer, peace officer or public officer, or any Illinois court system personnel acting lawfully under their duty to maintain safety and order in the courts. Makes other changes. Specifies that the provisions of the Act are severable. Effective immediately."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Norma Hernandez", "date": "2025-11-21", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}], "sponsorships": [{"name": "Norma Hernandez", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Norma Hernandez\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://ilga.gov/documents/legislation/104/HB/PDF/10400HB4212.pdf", "media_type": "application/pdf"}, {"url": "https://ilga.gov/Legislation/BillStatus/FullText?LegDocId=205940&DocName=10400HB4212&DocNum=4212&DocTypeID=HB&LegID=164592&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://ilga.gov/Legislation/BillStatus?DocNum=4212&GAID=18&DocTypeID=HB&LegId=164592&SessionID=114", "note": ""}], "extras": {}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:il/government", "name": "Illinois", "classification": "state", "division_id": "ocd-division/country:us/state:il"}, "scraped_at": "2025-12-10T21:42:46+00:00", "_id": "2a52384e-d611-11f0-9adc-9aff4f074f83"}