{"legislative_session": "104th", "identifier": "HB4181", "title": "SPRINGFIELD AIRPORT TERRITORY", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Airport Authorities Act. Provides that, in an order finding the results of an election to be favorable to the establishment of an airport authority, the circuit court shall determine, among other things, the population of each municipality within the authority having 5,000 or more inhabitants who reside within the corporate limits of the authority (rather than the population of each municipality within the authority having 5,000 or more inhabitants). Provides that, if a municipality not wholly located within the Springfield Airport Authority attains 5,000 or more inhabitants who reside within both the corporate limits of the municipality and the corporate limits of the Springfield Airport Authority, then a referendum may be held to determine whether those residents may be deannexed from the Springfield Airport Authority. Authorizes the referendum to be initiated either (i) by a petition signed by a number of voters equal to of at least 8% of the total votes cast for candidates for Governor in the last gubernatorial election by the registered voters who reside in the corporate limits of the municipality and the corporate limits of the Springfield Airport Authority or (ii) by the corporate authorities of a municipality not wholly located within the corporate limits of the Springfield Airport Authority with 5,000 or more inhabitants who reside within both the corporate limits of the municipality and the corporate limits of the Springfield Airport Authority. Specifies that, if the majority of those voting on the referendum approve of deannexation, then the Springfield Airport Authority shall either deannex all the territory within the corporate limits of the municipality or accept the appointment of one additional commissioner to the board who shall be appointed by the municipality that voted for deannexation. Requires the Springfield Airport Authority to vote to either deannex the affected property or accept the appointment of an additional commissioner within 45 days after certification of the vote. Requires all appointments of commissioners to boards of commissioners of airport authorities to indicate whether or not the person appointed resides within or without a municipality having a population of 5,000 or more inhabitants within the corporate limits of the authority (rather than a municipality having a population of 5,000 or more inhabitants)."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Stephanie A. Kifowit", "date": "2025-10-24", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-10-28", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-10-28", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Stephanie A. Kifowit", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Stephanie A. Kifowit\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://ilga.gov/documents/legislation/104/HB/PDF/10400HB4181.pdf", "media_type": "application/pdf"}, {"url": "https://ilga.gov/Legislation/BillStatus/FullText?LegDocId=205775&DocName=10400HB4181&DocNum=4181&DocTypeID=HB&LegID=164476&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://ilga.gov/Legislation/BillStatus?DocNum=4181&GAID=18&DocTypeID=HB&LegId=164476&SessionID=114", "note": ""}], "extras": {}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:il/government", "name": "Illinois", "classification": "state", "division_id": "ocd-division/country:us/state:il"}, "scraped_at": "2025-12-17T08:29:56+00:00", "_id": "91bc4c66-db22-11f0-9f92-e62e46442f22"}