{"legislative_session": "104th", "identifier": "HB4182", "title": "AIRPORT AUTHORITY BOARDS", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Airport Authorities Act. Provides that, for authorities other than Metropolitan Airport Authorities, the Greater Metropolitan Airport Authority, and the Crawford County Airport Authority, in the order finding the results of the election to be favorable to the establishment of the authority, the circuit court shall determine the population of the authority and the population of each municipality located in whole or in part within the corporate limits of the authority having 5,000 or more inhabitants who reside within the corporate limits of the authority according to the last census (rather than the population of each municipality within the authority having 5,000 or more inhabitants according to the last census). Provides that, if a municipality located in whole or in part within the corporate limits of the authority attains 5,000 or more inhabitants who reside within the corporate limits of the authority (rather than if the municipality that is located wholly within the authority attains 5,000 inhabitants), or if a municipality having 5,000 or more inhabitants who reside within the corporate limits of the authority is established (rather than if a municipality located wholly within the authority having a population of 5,000 or more inhabitants), then the presiding officer of the municipality may petition the circuit court for an order finding and determining the population of the municipality and, if it is found and determined upon the hearing of the petition that 5,000 or more inhabitants reside within the corporate limits of both the municipality and the authority (rather than the population of the municipality is 5,000 or more), then the board of commissioners of the authority as previously established shall be increased by one commissioner who shall reside within the corporate limits of the municipality and shall be appointed by its presiding officer. Provides that all appointments of Commissioners to Boards of Commissioners of Airport Authorities shall be in writing and shall indicate the legal residence of the person appointed and whether or not he resides within or without a municipality having a population of 5,000 or more inhabitants within the corporate limits of the authority (rather than having a population of 5,000 or more)."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Stephanie A. Kifowit", "date": "2025-10-24", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-10-28", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-10-28", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Stephanie A. Kifowit", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Stephanie A. Kifowit\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://ilga.gov/documents/legislation/104/HB/PDF/10400HB4182.pdf", "media_type": "application/pdf"}, {"url": "https://ilga.gov/Legislation/BillStatus/FullText?LegDocId=205776&DocName=10400HB4182&DocNum=4182&DocTypeID=HB&LegID=164477&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://ilga.gov/Legislation/BillStatus?DocNum=4182&GAID=18&DocTypeID=HB&LegId=164477&SessionID=114", "note": ""}], "extras": {}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:il/government", "name": "Illinois", "classification": "state", "division_id": "ocd-division/country:us/state:il"}, "scraped_at": "2025-12-07T21:33:31+00:00", "_id": "6065923c-d3b4-11f0-8ba8-1678c65e08db"}