{"legislative_session": "104th", "identifier": "HB4193", "title": "CANNABIS-R3 COMMITTEE", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "", "abstract": "Amends the Cannabis Regulation and Tax Act. In provisions regarding the Restore, Reinvest, and Renew (R3) Program, requires, within 90 days after the effective date of the amendatory Act, the President of the Senate and Speaker of the House to jointly appoint to the R3 Program Board 8 individuals who fulfill residency requirements, who possess certain expertise or backgrounds in an R3 Area, and who are appointed jointly by the Speaker of the House of Representatives and the President of the Senate from nominations received from not-for-profit organizations that are currently in existence and have been continuously in operation in the R3 Area since 1980. Changes other appointments to the R3 Program Board. Provides that general grant funds (rather than grant funds) shall be awarded by the Illinois Criminal Justice Information Authority, in coordination with the R3 Program Board. Establishes the R3 Community Steering Committee. Requires, within 60 days after the effective date of the amendatory Act, the President of the Senate and Speaker of the House to jointly appoint to the R3 Community Steering Committee 9 individuals from among individuals nominated by any not-for-profit organization that is currently in existence and has been continuously in operation in an R3 Area since 1968. Requires the nominees to possess certain expertise in an R3 Area and to fulfill residency requirements. Requires the Restore, Reinvest, and Renew (R3) Program to allocate and set aside at least 25% and no more than 30% of its annual funds for targeted community grant funding programs to be created, organized, and awarded by the Department of Commerce and Economic Opportunity, in coordination with the R3 Community Steering Committee. Provides that funding for legal services under the R3 Program shall exclude R3 Areas in Cook County unless approved by the Department of Commerce and Economic Opportunity, in coordination with the R3 Community Steering Committee. Changes the definition of \"Authority\". Makes technical changes."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Filed with the Clerk by Rep. Maurice A. West, II", "date": "2025-10-29", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["filing"], "related_entities": []}, {"description": "First Reading", "date": "2025-10-29", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Rules Committee", "date": "2025-10-29", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Maurice A. West, II", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Maurice A. West, II\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Introduced", "links": [{"url": "https://ilga.gov/documents/legislation/104/HB/PDF/10400HB4193.pdf", "media_type": "application/pdf"}, {"url": "https://ilga.gov/Legislation/BillStatus/FullText?LegDocId=205865&DocName=10400HB4193&DocNum=4193&DocTypeID=HB&LegID=164538&GAID=18&SessionID=114&SpecSess=&Session=&Print=1", "media_type": "text/html"}], "date": "", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "https://ilga.gov/Legislation/BillStatus?DocNum=4193&GAID=18&DocTypeID=HB&LegId=164538&SessionID=114", "note": ""}], "extras": {}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:il/government", "name": "Illinois", "classification": "state", "division_id": "ocd-division/country:us/state:il"}, "scraped_at": "2025-12-22T08:30:15+00:00", "_id": "70ab307c-df10-11f0-98ed-2a70ba9e5b6b"}